DELETE FROM meals;
DELETE FROM user_roles;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (date_time, description, calories, user_id)
VALUES ('2022.02.14 08:00:00', 'Завтрак (User100000)', 500, 100000),
       ('2022.02.14 13:00:00', 'Обед (User100000)', 1000, 100000),
       ('2022.02.14 20:00:00', 'Ужин (User100000)', 500, 100000),
       ('2022.02.13 08:00:00', 'Завтрак (User100000)', 500, 100000),
       ('2022.02.12 13:00:00', 'Обед (User100000)', 1000, 100000),
       ('2022.02.13 20:00:00', 'Ужин (User100000)', 500, 100000),
       ('2022.02.13 23:00:00', 'Ужин2 (User100000)', 100, 100000),

       ('2022.02.13 13:00:00', 'Обед (User100001)', 1100, 100001),
       ('2022.02.13 08:00:00', 'Завтрак (User100001)', 400, 100001),
       ('2022.02.13 20:00:00', 'Ужин (User100001)', 500, 100001),
       ('2022.02.12 00:00:00', 'Еда на граничное значение (User100001)', 100, 100001),
       ('2022.02.12 10:00:00', 'Завтрак (User100001)', 1000, 100001),
       ('2022.02.12 13:00:00', 'Обед (User100001)', 500, 100001),
       ('2022.02.12 20:00:00', 'Ужин (User100001)', 410, 100001)